[
  {
    "id": 1,
    "title": "Victima",
    "slug": "victima",
    "content": "Victima is the Association of Entrepreneurs Harmed by Insurers. The main goal of the Association is to provide free assistance to entrepreneurs in claiming compensation.\nI created the visual identity, including the logo design, website design, which was coded as a minimalist WordPress template.",
    "logo": "/projects/victima/logoVictima.svg",
    "gallery": [
      "victima/1",
      "victima/2",
      "victima/3"
    ],
    "link": "victima.pl",
    "bottomHooksHeading": "It was a long time ago. I create timeless things...",
    "bottomHooksSpan": "My first moments with WordPress ;)"
  },
  {
    "id": 2,
    "title": "Liconfe",
    "slug": "liconfe",
    "content": "Liconfe is the largest industrial sewing thread manufacturer on the Iberian Peninsula.\nFor the main distributor in Eastern Europe, I created a website design, which was coded as a minimalist WordPress template. I also designed business cards, an offer catalog and a triptych calendar...",
    "logo": "/projects/liconfe/logoLiconfe.svg",
    "gallery": [
      "liconfe/1",
      "liconfe/2",
      "liconfe/3"
    ],
    "link": "liconfe.pl",
    "bottomHooksHeading": "I learned a lot about threads.",
    "bottomHooksSpan": "But I sewed the website in code ;)"
  },
  {
    "id": 3,
    "title": "Qi-Med",
    "slug": "qimed",
    "content": "Qi-med practices early Chinese medicine, Daoism, shamanism and naturalism, helping to find one's true nature and accept all life experiences as necessary to fulfill the unique plan that is life.\nI vectored the logo, designed the website, which I coded as a minimalist WordPress template.",
    "logo": "/projects/qi-med/logoQiMed.svg",
    "gallery": [
      "qi-med/1",
      "qi-med/2",
      "qi-med/3"
    ],
    "link": "qi-med.com",
    "bottomHooksHeading": "Conscious eating leads to a better life.",
    "bottomHooksSpan": "But the learning and experimenting process is delicious ;)"
  },
  {
    "id": 4,
    "title": "AudioClinic",
    "slug": "audioclinic",
    "content": "Hearing is one of the most important senses in our body. The proof is that it is the only sense that remains active throughout our lives, even when we sleep. Mrs. Kasia helps children and adults to simply hear. Thank you for that.\nI designed the website, which I am coding in React, the final version of the site will be optimized and fast, based on the latest web technologies.",
    "logo": "/projects/audioclinic/logoAudioclinic.svg",
    "gallery": [
      "audioclinic/1",
      "audioclinic/2",
      "audioclinic/3"
    ],
    "link": "",
    "bottomHooksHeading": "For me, hearing has become even more important because",
    "bottomHooksSpan": "I hear music."
  },
  {
    "id": 5,
    "title": "DobryKominek",
    "slug": "dobrykominek",
    "content": "Dobry Kominek is a brand, place and people where you will find warmth and comfort, as well as expert help and lots of equipment to heat your home.\nI designed the logo, the online store, which I coded as a minimalist PrestaShop template.",
    "logo": "/projects/dobrykominek/logoDobrykominek.svg",
    "gallery": [
      "dobrykominek/1",
      "dobrykominek/2",
      "dobrykominek/3"
    ],
    "link": "dobrykominek.com",
    "bottomHooksHeading": "They sell warmth-giving equipment...",
    "bottomHooksSpan": "But they have the most warmth in their hearts :-)"
  },
  {
    "id": 6,
    "listTitle": "Rodos",
    "title": "Rodos Dream Tours",
    "slug": "rodosdreamtours",
    "content": "Rodos is Mrs. Martyna - an energetic, warm and passionate citizen of the world. Dream - because it is her dream, and tour - for the extraordinary tours around Rodos with a local Polish travel agency.\nI designed the logo, the website with a reservation system, which I coded as a minimalist WordPress template.",
    "logo": "/projects/rodosdreamtours/logoRodosDreamTours.svg",
    "gallery": [
      "rodosdreamtours/1",
      "rodosdreamtours/2",
      "rodosdreamtours/3"
    ],
    "link": "rodosdreamtours.pl",
    "bottomHooksHeading": "This project is an extraordinary journey.",
    "bottomHooksSpan": "Because the journey is as important as the destination."
  },
  {
    "id": 7,
    "title": "Przytulaśna",
    "slug": "przytulasna",
    "content": "An exceptional dance school where passion meets friends and learning mixes with the joy of movement, self-expression, closeness and music.\nI designed the logo, the website, which I coded as a minimalist WordPress template.",
    "logo": "/projects/przytulasna/logoPrzytulasna.svg",
    "gallery": [
      "przytulasna/1",
      "przytulasna/2",
      "przytulasna/3"
    ],
    "link": "przytulasna.pl",
    "bottomHooksHeading": "Dance",
    "bottomHooksSpan": "is the road in the same direction"
  },
  {
    "id": 8,
    "listTitle": "Malewska",
    "title": "Adrianna Malewska",
    "slug": "malewska",
    "content": "Appearance is the first stop to getting to know someone because we usually see first and then hear. Mrs. Adrianna is a passionate and creative stylist from the fashion world.\nI designed the logo, the website, which I coded in React, the final version of the site is less than five megabytes. I also created a business card and a gift card.",
    "logo": "/projects/malewska/logoMalewska.svg",
    "gallery": [
      "malewska/1",
      "malewska/2",
      "malewska/3"
    ],
    "link": "malewska.com",
    "bottomHooksHeading": "A good website is like a piece of clothing.",
    "bottomHooksSpan": "Tailored to fit."
  },
  
  {
    "id": 9,
    "title": "Marzec",
    "slug": "marzec",
    "content": "I’ll let you in on a secret: one day you will die. It’s a good idea to get your affairs in order and take care of succession, both for yourself and your business. Let me introduce you to Mariusz—a specialist with 30 years of experience in finance—who will help you with inheritance planning and securing your assets for the future. Mariusz Marzec is someone who knows everything about financial mechanisms and insurance. Want to learn more? Visit the website...\nI created the logo design and website, coding it as a minimalist template for WordPress.",
    "logo": "/projects/marzec/logoMarzec.svg",
    "gallery": [
      "marzec/1",
      "marzec/2",
      "marzec/3"
    ],
    "link": "mariuszmarzec.pl",
    "bottomHooksHeading": "I’m not presenting an offer,",
    "bottomHooksSpan": "I’m presenting a person."
  },
  {
    "id": 10,
    "listTitle": "Sosna",
    "title": "Katarzyna Sosna",
    "slug": "sosna",
    "content": "Let me introduce Katarzyna Sosna — an experienced massage therapist and trainer with 14 years of experience, who passionately teaches techniques such as Lomi Lomi Nui massage and supports the development of skills and sensitivity. I created the website using Next.js (production version: SSR) with a lightweight content management system (Cockpit CMS), ensuring fast loading and easy editing. I implemented a lightweight booking system without processing personal data and optimized the site for performance – the production version weighs only 7.9 MB. Data is cached in the browser, while Cloudflare ensures lightning-fast delivery. All images are saved in WebP format, and icons, including the logo, are embedded as React functions. The site features smooth HTML animations managed through page scrolling. The design process was skipped — I created the final look directly by coding.",
    "logo": "/projects/sosna/logoKatarzynaSosna.svg",
    "gallery": [
      "sosna/1",
      "sosna/2",
      "sosna/3",
      "sosna/4",
      "sosna/5",
      "sosna/6"
    ],
    "video": "sosna/video/sosna",
    "link": "katarzynasosna.pl",
    "bottomHooksHeading": "Touch is an important sense because it brings closeness,",
    "bottomHooksSpan": "and when properly trained, it can heal."
  },
  {
    "id": 11,
    "listTitle": "Spontan",
    "title": "Spontan Latino na Paprach",
    "slug": "spontan",
    "content": "I created a website for the community initiative Spontan Latino na Paprach, which combines a love for dance and Latino music with the unique atmosphere of gatherings by the picturesque Paprocany Lake in Tychy. The website was built using Next.js, leveraging server-side rendering (SSR) to ensure dynamic content loading and excellent performance. The project achieved top scores in PageSpeed Insights (90–100 on mobile devices and 100 on desktops), making it smooth, highly accessible, and SEO-compliant. The homepage of the application features scroll-triggered animations and, without cached memory, weighs only 904.8 kB. All images are in WebP format, with optimized browser caching and CloudFlare ensuring fast loading. Icons and the logo are embedded as React functions, and the styles are implemented using Dart Sass. Additionally, I designed the logo and graphic materials supporting charity events, including the Taneczny Finał WOŚP, which I have co-organized since 2023. The entire project was created without a traditional design process—I developed the site's appearance directly in code.",
    "logo": "/projects/spontanlatinonapaprach/logoSpontanLatino.svg",
    "gallery": [
      "spontanlatinonapaprach/1",
      "spontanlatinonapaprach/2",
      "spontanlatinonapaprach/3",
      "spontanlatinonapaprach/4",
      "spontanlatinonapaprach/5",
      "spontanlatinonapaprach/6",
      "spontanlatinonapaprach/7"
    ],
    "link": "spontanlatinonapaprach.pl",
    "bottomHooksHeading": "Dance is a conversation between bodies.",
    "bottomHooksSpan": "Without words."
  }  
]
